<template>
    <div class="w-[100%]" v-if="faqs.length">
        <div class="flex flex-row justify-center mb-3">
            <div class="w-[100%] grow-0 shrink-0 basis-[auto]"><!--Don't know :(-->
                <div class="font-bold text-[22px] text-center text-black mb-3">{{ textFaqHeading }}</div>
                <Accordion>
                    <AccordionItem v-for="faq in faqs">
                        <template #accordion-trigger>
                            {{ faq.question }}
                        </template>
                        <template #accordion-content>
                            <div v-html="faq.answer"></div>
                        </template>
                    </AccordionItem>
                </Accordion>
            </div>
        </div>
    </div>
</template>

<script setup>
import {onMounted, ref} from "vue";
import Accordion from "@/Components/Accordion/Accordion.vue";
import AccordionItem from "@/Components/Accordion/AccordionItem.vue";

const faqs = [
    {
        question: 'Чому я при отриманні посилки на Новій пошті просять сплатити комісію?',
        answer: 'При оформленні замовлення способом оплати ви обрали “накладний платіж”, що передбачає оплату комісії за послуги Нової пошти під час переказу грошей. Так, при отриманні посилки оплачуєте замовлення, вартість доставки та комісію за накладений платіж (20 грн + 2% від суми замовлення),'
    },
    {
        question: 'Чому я при отриманні посилки на Новій пошті просять сплатити комісію?',
        answer: 'При оформленні замовлення способом оплати ви обрали “накладний платіж”, що передбачає оплату комісії за послуги Нової пошти під час переказу грошей. Так, при отриманні посилки оплачуєте замовлення, вартість доставки та комісію за накладений платіж (20 грн + 2% від суми замовлення),'
    },
    {
        question: 'Чому я при отриманні посилки на Новій пошті просять сплатити комісію?',
        answer: 'При оформленні замовлення способом оплати ви обрали “накладний платіж”, що передбачає оплату комісії за послуги Нової пошти під час переказу грошей. Так, при отриманні посилки оплачуєте замовлення, вартість доставки та комісію за накладений платіж (20 грн + 2% від суми замовлення),'
    },
    {
        question: 'Чому я при отриманні посилки на Новій пошті просять сплатити комісію?',
        answer: 'При оформленні замовлення способом оплати ви обрали “накладний платіж”, що передбачає оплату комісії за послуги Нової пошти під час переказу грошей. Так, при отриманні посилки оплачуєте замовлення, вартість доставки та комісію за накладений платіж (20 грн + 2% від суми замовлення),'
    },
    {
        question: 'Чому я при отриманні посилки на Новій пошті просять сплатити комісію?',
        answer: 'При оформленні замовлення способом оплати ви обрали “накладний платіж”, що передбачає оплату комісії за послуги Нової пошти під час переказу грошей. Так, при отриманні посилки оплачуєте замовлення, вартість доставки та комісію за накладений платіж (20 грн + 2% від суми замовлення),'
    },
    {
        question: 'Чому я при отриманні посилки на Новій пошті просять сплатити комісію?',
        answer: 'При оформленні замовлення способом оплати ви обрали “накладний платіж”, що передбачає оплату комісії за послуги Нової пошти під час переказу грошей. Так, при отриманні посилки оплачуєте замовлення, вартість доставки та комісію за накладений платіж (20 грн + 2% від суми замовлення),'
    }
]

const state = ref({
    faqs: [],
    activeItem: null,
})

defineProps({
    lang: {
        type: String,
        default: 'ua'
    },
    textFaqHeading: {
        type: String,
        default: 'FAQ'
    },
});

onMounted(() => {
    axios.get('/api/v1/faq/list')
        .then(({data}) => state.value.faqs = data.result)
        .catch((response) => console.log(response))
})
</script>
